public class Program34 {
    public static void main(String[] args) {

        int n = 23;

        String[] tens = {
                "десять","одиннадцать","двенадцать","тринадцать","четырнадцать",
                "пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать",
                "двадцать","двадцать одно","двадцать два","двадцать три","двадцать четыре",
                "двадцать пять","двадцать шесть","двадцать семь","двадцать восемнадцать",
                "двадцать девять","тридцать","тридцать одно","тридцать два","тридцать три",
                "тридцать четыре","тридцать пять","тридцать шесть","тридцать семь",
                "тридцать восемь","тридцать девять","сорок"
        };

        String word;

        if (n==21||n==31)
            word="учебное задание";
        else if (n>=22 && n<=24 || n>=32 && n<=34)
            word="учебных задания";
        else
            word="учебных заданий";

        System.out.println(tens[n-10]+" "+word);
    }
}
