public class Program35 {
    public static void main(String[] args) {

        int n = 256;

        String[] hundreds = {
                "сто","двести","триста","четыреста",
                "пятьсот","шестьсот","семьсот",
                "восемьсот","девятьсот"
        };

        String[] tens = {
                "","десять","двадцать","тридцать",
                "сорок","пятьдесят","шестьдесят",
                "семьдесят","восемьдесят","девяносто"
        };

        String[] ones = {
                "","один","два","три","четыре",
                "пять","шесть","семь","восемь","девять"
        };

        String[] tenTo19 = {
                "десять","одиннадцать","двенадцать","тринадцать",
                "четырнадцать","пятнадцать","шестнадцать",
                "семнадцать","восемнадцать","девятнадцать"
        };

        int h=n/100;
        int t=(n%100)/10;
        int o=n%10;

        String result=hundreds[h-1]+" ";

        if(t==1)
            result+=tenTo19[o];
        else
            result+=tens[t]+" "+ones[o];

        System.out.println(result.trim());
    }
}
